; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 882422 2 3 2 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	infrared0 - mode
	infrared1 - mode
	Star2 - direction
	Star0 - direction
	GroundStation7 - direction
	GroundStation4 - direction
	Star1 - direction
	GroundStation6 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument2 infrared0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star1)
	(supports instrument3 infrared1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 infrared1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
)
(:goal (and
	(pointing satellite0 GroundStation6)
	(have_image Phenomenon8 infrared1)
	(have_image Phenomenon9 infrared0)
	(have_image Planet10 infrared0)
	(have_image Star11 infrared0)
	(have_image Planet12 infrared0)
	(have_image Planet13 infrared1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (turn_to satellite0 groundstation6 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation6)
   goals met: 1 of 7
3. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 7
4. (turn_to satellite1 groundstation3 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 groundstation3)
   goals met: 1 of 7
5. (calibrate satellite1 instrument4 groundstation3)
   added: (calibrated instrument4)
   goals met: 1 of 7
6. (turn_to satellite0 planet13 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 planet13)
   goals met: 0 of 7
7. (turn_to satellite1 star11 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star11)
   goals met: 0 of 7
8. (turn_to satellite0 groundstation4 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 7
9. (take_image satellite1 star11 instrument4 infrared0)
   added: (have_image star11 infrared0)
   goals met: 1 of 7
10. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 1 of 7
11. (turn_to satellite1 planet13 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 planet13)
   goals met: 1 of 7
12. (turn_to satellite0 star0 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star0)
   goals met: 1 of 7
13. (take_image satellite1 planet13 instrument4 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 2 of 7
14. (turn_to satellite0 groundstation6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation6)
   goals met: 3 of 7
15. (turn_to satellite1 planet12 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet12)
   goals met: 3 of 7
16. (turn_to satellite0 phenomenon8 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 7
17. (take_image satellite1 planet12 instrument4 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 3 of 7
18. (take_image satellite0 phenomenon8 instrument1 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 4 of 7
19. (turn_to satellite0 groundstation6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation6)
   goals met: 5 of 7
20. (turn_to satellite1 planet10 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet10)
   goals met: 5 of 7
21. (take_image satellite1 planet10 instrument4 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 6 of 7
22. (turn_to satellite1 phenomenon9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon9)
   goals met: 6 of 7
23. (take_image satellite1 phenomenon9 instrument4 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 7 of 7
